ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/TOP_RCM_TOP_RCM_53200000h.xml
	<bitfield id="PLL_PER_STATUS_LDOPWDN" width="1" begin="29" end="29" resetval="0x1" description="1'b1 indicates ADPLLLJ internal LDO is power down. VDDLDOOUT willbe un-defined in this condition" range="29" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_RECAL_BSTATUS3" width="1" begin="28" end="28" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="28" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_RECAL_OPPIN" width="1" begin="27" end="27" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="27" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKOUTLDOENACK" width="1" begin="12" end="12" resetval="0x1" description="Indicates the enable/disable condition of CLKOUTLDOEN0x0 = CLKOUTLDO gating completed0x1 = CLKOUTLDO enabling completed" range="12" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKDCOLDOACK" width="1" begin="11" end="11" resetval="0x0" description="Indicates the enable/disable condition of CLKDCOLDOEN0x0 = CLKDCOLDO gating completed0x1 = CLKDCOLDO enabling completed" range="11" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_PHASELOCK" width="1" begin="10" end="10" resetval="0x0" description="Status on PHASELOCK output pin" range="10" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_FREQLOCK" width="1" begin="9" end="9" resetval="0x0" description="Status on FREQLOCK output pin" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_BYPASSACK" width="1" begin="8" end="8" resetval="0x1" description="Status of BYPASSACK output pin" range="8" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_STBYRETACK" width="1" begin="7" end="7" resetval="0x0" description="Standby and retention status0x0: indicates to SOC that all internal clocks in ADPLLLJ are activeand it is starting the relock process.0x1: indicates to SOC that all internal clocks in ADPLLLJ are gatedand it is ready for retention." range="7" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_LOSSREF" width="1" begin="6" end="6" resetval="0x1" description="Reference input loss is indicated by 1'b0." range="6" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_CLKOUTENACK" width="1" begin="5" end="5" resetval="0x0" description="Indicates the enable/disable condition of CLKOUTEN0x0 = CLKOUT gating completed0x1 = CLKOUT enabling completed" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_LOCK2" width="1" begin="4" end="4" resetval="0x0" description="ADPLL internal loop lock status" range="4" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_M2CHANGEACK" width="1" begin="3" end="3" resetval="0x0" description="Acknowledge for change to M2 divider. Toggles from 1-0 or 0-1[depending on current value] once CLKOUT frequency change hascompleted." range="3" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_SSCACK" width="1" begin="2" end="2" resetval="0x0" description="Spread Spectrum status0x0 : Spread-spectrum Clocking is disabled on output clocks0x1 : Spread-spectrum Clocking is enabled on output clocks" range="2" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_HIGHJITTER" width="1" begin="1" end="1" resetval="0x0" description="1'b1 indicates jitter. After PHASELOCK is asserted high, theHIGHJITTER flag is asserted high if phase error between REFCLKand FBCLK greater than 24%." range="1" rwaccess="R"/>
	<bitfield id="PLL_PER_STATUS_BYPASS" width="1" begin="0" end="0" resetval="0x1" description="Bypass status signal. 1'b1 CLKOUT in bypass" range="0" rwaccess="R"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER" acronym="TOP_RCM_PLL_PER_HSDIVIDER" offset="2088" width="32" description="Peripheral PLL high speed divider config.">
		<bitfield id="PLL_PER_HSDIVIDER_LDOPWDNACK" width="1" begin="17" end="17" resetval="0x0" description="LDO Power Down Ack" range="17" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_BYPASSACKZ" width="1" begin="16" end="16" resetval="0x0" description="HSDIVIDER Bypass Ack" range="16" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_TENABLEDIV" width="1" begin="2" end="2" resetval="0x0" description="TENABLEDIV rising edge loads the values of M2REG and N2REG into ADPLLLJ register.  TENABLEDIV could be activated anytime when the DPLL digital is in power-up condition. M2 and N2 latch [active rise edge]" range="2" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_LDOPWDN" width="1" begin="1" end="1" resetval="0x0" description="1'b1 indicates ADPLLLJ internal LDO is power down. VDDLDOOUT willbe un-defined in this condition" range="1" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_BYPASS" width="1" begin="0" end="0" resetval="0x0" description="HSDIVIDER Bypass" range="0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" offset="2092" width="32" description="Peripheral PLL high speed divider clock 0 control.">
		<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER CLKOUT0 divider and hence CLKOUT0 output0h[R/W] = CLKOUT0 divider active1h[R/W] = CLKOUT0 divider is powered down" range="12" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT0 status0h[R] = The clock output is gated1h[R] = The clock output is enabled" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT00h[R/W] = Automatically gate this clock when there is nodependency for it1h[R/W] = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT0_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT0_DIV" width="5" begin="4" end="0" resetval="0x11" description="DPLL post-divider factor, HSDIVIDER CLKOUT0, for internal clock generation.Divide values from 1 to 31.0h[R/W] = Reserved" range="4:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" offset="2096" width="32" description="Peripheral PLL high speed divider clock 1 control.">
		<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER CLKOUT1 divider and hence CLKOUT1 output0h[R/W] = CLKOUT1 divider active1h[R/W] = CLKOUT1 divider is powered down" range="12" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT1 status0h[R] = The clock output is gated1h[R] = The clock output is enabled" range="9" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT10h[R/W] = Automatically gate this clock when there is nodependency for it1h[R/W] = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="R/W"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT1_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="R"/>
	<bitfield id="PLL_PER_HSDIVIDER_CLKOUT1_DIV" width="5" begin="4" end="0" resetval="0x9" description="DPLL post-divider factor, HSDIVIDER CLKOUT1, for internal clock generation.Divide values from 1 to 31.0h[R/W] = Reserved" range="4:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_RSTCTRL" acronym="TOP_RCM_PLL_PER_RSTCTRL" offset="2108" width="32" description="Peripheral PLL reset control.">
		<bitfield id="PLL_PER_RSTCTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the PLLWrite 3'b111 : Override is enabled and Reset is asserted" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" acronym="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" offset="2112" width="32" description="Peripheral PLL high speed divider reset control.">
		<bitfield id="PLL_PER_HSDIVIDER_RSTCTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the HSDIVIDERWrite 3'b111 : Override is enabled and Reset is asserted" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT0_CLK_SRC_SEL" offset="3072" width="32" description="Clock Source select register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - RCCLK32K0x777 - CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT1_CLK_SRC_SEL" offset="3076" width="32" description="Clock Source select register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - RCCLK32K0x777 - CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_DIV_VAL" acronym="TOP_RCM_CLKOUT0_DIV_VAL" offset="3080" width="32" description="Clock Divider register for CLKOUT clock.">
		<bitfield id="CLKOUT0_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_DIV_VAL" acronym="TOP_RCM_CLKOUT1_DIV_VAL" offset="3084" width="32" description="Clock Divider register for CLKOUT clock.">
		<bitfield id="CLKOUT1_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_GATE" acronym="TOP_RCM_CLKOUT0_CLK_GATE" offset="3088" width="32" description="Clock Gating register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_GATE" acronym="TOP_RCM_CLKOUT1_CLK_GATE" offset="3092" width="32" description="Clock Gating register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_CLKOUT0_CLK_STATUS" acronym="TOP_RCM_CLKOUT0_CLK_STATUS" offset="3096" width="32" description="Clock Status register for CLKOUT clock.">
		<bitfield id="CLKOUT0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15:8" rwaccess="R"/>
	<bitfield id="CLKOUT0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_CLKOUT1_CLK_STATUS" acronym="TOP_RCM_CLKOUT1_CLK_STATUS" offset="3100" width="32" description="Clock Status register for CLKOUT clock.">
		<bitfield id="CLKOUT1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15:8" rwaccess="R"/>
	<bitfield id="CLKOUT1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" acronym="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" offset="3104" width="32" description="Clock Source select register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for TRC ClkoutData should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Use the following values to select clk src-0x000 - WUCPUCLK0x111 - DPLL_CORE_HSDIV0_CLKOUT00x222 - DPLL_CORE_HSDIV0_CLKOUT10x333 - DPLL_PER_HSDIV0_CLKOUT00x444 - DPLL_PER_HSDIV0_CLKOUT10x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_DIV_VAL" acronym="TOP_RCM_TRCCLKOUT_DIV_VAL" offset="3108" width="32" description="Clock Divider register for TRC clkout.">
		<bitfield id="TRCCLKOUT_DIV_VAL_CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for TRC selected clock..To set the divider value of [n+1] configure the register to '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_GATE" acronym="TOP_RCM_TRCCLKOUT_CLK_GATE" offset="3112" width="32" description="Clock Gating register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Clock gatring config for TRC ClkoutData should be loaded as multibit.  Write 3'b000 : Clock is ungated [multibit 000]Write 3'b111 : Clock is gated [multibit 111]" range="2:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_TRCCLKOUT_CLK_STATUS" acronym="TOP_RCM_TRCCLKOUT_CLK_STATUS" offset="3116" width="32" description="Clock Status register for TRC clkout.">
		<bitfield id="TRCCLKOUT_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for TRCCLK Clkout Clock" range="15:8" rwaccess="R"/>
	<bitfield id="TRCCLKOUT_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for TRCCLK Clkout Clock" range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_LOCK0_KICK0" acronym="TOP_RCM_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_LOCK0_KICK1" acronym="TOP_RCM_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_INTR_RAW_STATUS" acronym="TOP_RCM_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="TOP_RCM_INTR_ENABLED_STATUS_CLEAR" acronym="TOP_RCM_INTR_ENABLED_STATUS_CLEAR" offset="4116" width="32" description="Interrupt Enabled Status/Clear register.">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="TOP_RCM_INTR_ENABLE" acronym="TOP_RCM_INTR_ENABLE" offset="4120" width="32" description="Interrupt Enable register.">
		<bitfield id="PROXY_ERR_EN" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR_EN" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="TOP_RCM_INTR_ENABLE_CLEAR" acronym="TOP_RCM_INTR_ENABLE_CLEAR" offset="4124" width="32" description="Interrupt Enable Clear register.">
		<bitfield id="PROXY_ERR_EN_CLR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="KICK_ERR_EN_CLR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="TOP_RCM_EOI" acronym="TOP_RCM_EOI" offset="4128" width="32" description="EOI register.">
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_RCM_FAULT_ADDRESS" acronym="TOP_RCM_FAULT_ADDRESS" offset="4132" width="32" description="Fault Address register.">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31:0" rwaccess="R"/>
	</register><register id="TOP_RCM_FAULT_TYPE_STATUS" acronym="TOP_RCM_FAULT_TYPE_STATUS" offset="4136" width="32" description="Fault Type Status register.">
		<bitfield id="FAULT_NS" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="R"/>
	<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault Type  10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1   01_0000 = Supervisor write fault  - priv = 1 dir = 0  00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1  00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1  00_0010 = User write fault - priv = 0 dir = 0  00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1  00_0000 = No fault" range="5:0" rwaccess="R"/>
	</register><register id="TOP_RCM_FAULT_ATTR_STATUS" acronym="TOP_RCM_FAULT_ATTR_STATUS" offset="4140" width="32" description="Fault Attribute Status register.">
		<bitfield id="FAULT_XID" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31:20" rwaccess="R"/>
	<bitfield id="FAULT_ROUTEID" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19:8" rwaccess="R"/>
	<bitfield id="FAULT_PRIVID" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7:0" rwaccess="R"/>
	</register><register id="TOP_RCM_FAULT_CLEAR" acronym="TOP_RCM_FAULT_CLEAR" offset="4144" width="32" description="Fault Clear register.">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="W"/>
	</register>
</module>